my_list = [
    "-50…+100",
    "-50…+100 ",
    "-50…\n+120 ",
    "0…10 ",
    "0…0,0025",
    "0…4 ",
    ">210",
    ">-0,9",
    ">+0,9",
    ">7,41 <0,0001",
    "<0,601",
    "<5",
    "от 0 до 250 мкм",
    "от 0 до\n250 мкм",
    "более125 мкм",
    "менее -0,6 мм более +0,6 мм",
    "менее -0.\n6 мм более +0.6 мм"
]

import re


reg = r'((([Оо]т)|([Дд]о))?((([Мм]ен)|([Бб]ол)).{2,3})? ?([-+<>0-9,.]+))'

for string in my_list:
    # i: str = re.sub(r'[\n\+]|(\s{,1}[^\n])?(([Оо]т)|([Дд]о))(\s?)', '', i)
    # xz = re.findall(reg, i)
    # print(list(match[0] for match in xz))

    # i: str = re.sub(r'(\s{,1}[^\n])?[Бб]ол[а-я]+(\s?)', '>', i)
    # i: str = re.sub(r'(\s{,1}[^\n])?[Мм]ен[а-я]+(\s?)', '<', i)

    for symbol in ('\n', '+'):
        string = string.replace(symbol, '')

    print(string)
