my_list = [
    "-50…+100",
    "-50…+100 ",
    "-50…+120 ",
    "0…10 ",
    "0…0,0025",
    "0…4 ",
    ">210",
    ">-0,9",
    ">+0,9",
    ">7,41 <0,0001",
    "<0,601",
    "<5",
    "от 0 до 250 мкм",
    "от 0 до250 мкм",
    "более125 мкм",
    "менее -0,6 мм более +0,6 мм",
    "менее -0.6 мм более +0.6 мм",
    "от минус 50 до плюс 120 °C",
    "от минус 50 до плюс 120 °C",
    "мин. 50",
    "мин.50"
]

import re


r = r'((([Оо]т\s?)|([Дд]о\s?))?(([Мм]ен[а-я]+\s?)|([Бб]ол[а-я]+\s?)|[><])?((([Мм]ин([а-я]+\s?)?)|([Пп]л([а-я]+\s?)?)|[-+])\.?\s?)?([,.0-9]+))'

for input in my_list:
    input = input.replace('\n', '')
    xz = re.findall(r, input)
    
    out = []
    for i in xz:
        out.append(i[0])
    
    print(out)
